<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>aysiu</string>
		<key>creation_date</key>
		<date>2015-12-03T22:22:44Z</date>
		<key>munki_version</key>
		<string>2.4.0.2561</string>
		<key>os_version</key>
		<string>10.11.1</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
	</array>
	<key>category</key>
	<string>Scripts</string>
	<key>description</key>
	<string>Hide a specific user from login screen.</string>
	<key>developer</key>
	<string>aysiu</string>
	<key>display_name</key>
	<string>Hide User From Login Window</string>
	<key>installcheck_script</key>
	<string>#!/bin/bash

testVariable=$(/usr/bin/dscl . -read /Users/NAMEOFUSERTOHIDE IsHidden)

if [ "$testVariable" == "dsAttrTypeNative:IsHidden: 1" ]; then

	# It's installed
	exit 1
else
	# It needs to be installed
	exit 0
fi</string>
	<key>installer_type</key>
	<string>nopkg</string>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>HideUserFromLoginWindow</string>
	<key>postinstall_script</key>
	<string>#!/bin/bash

# Hide the specific account from the login screen
/usr/bin/dscl . create /Users/NAMEOFUSERTOHIDE IsHidden -bool TRUE</string>
	<key>unattended_install</key>
	<true/>
	<key>unattended_uninstall</key>
	<true/>
	<key>uninstall_method</key>
	<string>uninstall_script</string>
	<key>uninstall_script</key>
	<string>#!/bin/bash

# Unhide the specific account from the login screen
/usr/bin/dscl . create /Users/NAMEOFUSERTOHIDE IsHidden -bool FALSE</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.0</string>
</dict>
</plist>
